In [133]:
#Import numpy and pandas

In [134]:
import numpy as np 
import pandas as pd

In [135]:
#Create a dictionary (named student) of 10 students with name, relationship status, age and department columns

In [136]:
student= { 'student': ['tunde', 'kola', 'bola', 'kunle', 'fatima', 'ishola', 'hibatullah', 'ghalia', 'sofia', 'akanmu'],
      'relationship status': ['married', 'married','single', 'single', 'married', 'divorced', 'widow','single', 'marrried', 'widow'],
       
      'Age':['23','44','12','40', '45','54',' 24', '89', '150', '78'],
    'department':['BCH', 'MCB','LAW', 'AGRIC', 'SAP+D', 'CI', 'EMINES', 'ESAFE', 'GTI', 'SCS']}

In [137]:
student

{'student': ['tunde',
  'kola',
  'bola',
  'kunle',
  'fatima',
  'ishola',
  'hibatullah',
  'ghalia',
  'sofia',
  'akanmu'],
 'relationship status': ['married',
  'married',
  'single',
  'single',
  'married',
  'divorced',
  'widow',
  'single',
  'marrried',
  'widow'],
 'Age': ['23', '44', '12', '40', '45', '54', ' 24', '89', '150', '78'],
 'department': ['BCH',
  'MCB',
  'LAW',
  'AGRIC',
  'SAP+D',
  'CI',
  'EMINES',
  'ESAFE',
  'GTI',
  'SCS']}

In [138]:
#Add cgpa to the dictionary

In [139]:
student['cgpa'] = ['3.4', '5.0', '4.6', '3.2', '2.3', '4.3', '4.2', '2.8', '3.8', '4.3']

In [140]:
student

{'student': ['tunde',
  'kola',
  'bola',
  'kunle',
  'fatima',
  'ishola',
  'hibatullah',
  'ghalia',
  'sofia',
  'akanmu'],
 'relationship status': ['married',
  'married',
  'single',
  'single',
  'married',
  'divorced',
  'widow',
  'single',
  'marrried',
  'widow'],
 'Age': ['23', '44', '12', '40', '45', '54', ' 24', '89', '150', '78'],
 'department': ['BCH',
  'MCB',
  'LAW',
  'AGRIC',
  'SAP+D',
  'CI',
  'EMINES',
  'ESAFE',
  'GTI',
  'SCS'],
 'cgpa': ['3.4',
  '5.0',
  '4.6',
  '3.2',
  '2.3',
  '4.3',
  '4.2',
  '2.8',
  '3.8',
  '4.3']}

In [141]:
#Remove relationship status from the dictionary

In [142]:
student.pop('relationship status')

['married',
 'married',
 'single',
 'single',
 'married',
 'divorced',
 'widow',
 'single',
 'marrried',
 'widow']

In [143]:
#Convert the dictionary to a dataframe(df)

In [144]:
df = pd.DataFrame(student)

In [145]:
df

      student  Age department cgpa
0       tunde   23        BCH  3.4
1        kola   44        MCB  5.0
2        bola   12        LAW  4.6
3       kunle   40      AGRIC  3.2
4      fatima   45      SAP+D  2.3
5      ishola   54         CI  4.3
6  hibatullah   24     EMINES  4.2
7      ghalia   89      ESAFE  2.8
8       sofia  150        GTI  3.8
9      akanmu   78        SCS  4.3

In [146]:
#Add admission_date (year, month and day)and gender columns to the dataframe

In [147]:
df['admission_date'] = ['2020-10-05', '2021-12-13','2019-03-05', '2017-05-02', '2017-06-09', '2010-10-13', '2016-06-21', '2017-06-01', '2012-10-03', '2015-04-02']
df['gender'] =['male', 'female', 'male', 'male', 'female', 'male', 'female', 'male', 'female', 'female']

In [148]:
#Check the dataframe

In [149]:
df

      student  Age department cgpa admission_date  gender
0       tunde   23        BCH  3.4     2020-10-05    male
1        kola   44        MCB  5.0     2021-12-13  female
2        bola   12        LAW  4.6     2019-03-05    male
3       kunle   40      AGRIC  3.2     2017-05-02    male
4      fatima   45      SAP+D  2.3     2017-06-09  female
5      ishola   54         CI  4.3     2010-10-13    male
6  hibatullah   24     EMINES  4.2     2016-06-21  female
7      ghalia   89      ESAFE  2.8     2017-06-01    male
8       sofia  150        GTI  3.8     2012-10-03  female
9      akanmu   78        SCS  4.3     2015-04-02  female

In [150]:
'''Create the same dataframe (df2) with all the columns 
(name, age, department, admission_date and gender) 
from a list instead of a dictionary.'''

'Create the same dataframe (df2) with all the columns \n(name, age, department, admission_date and gender) \nfrom a list instead of a dictionary.'

In [151]:
liist= [[ 'tunde', 23, 'BCH', '2020-10-25', 'MALE' ],['kola', 44, 'MCB', '2021-12-13', 'FEMALE' ], 
        ['Bola', 12, 'LAW', '2019-03-05', 'MALE' ],['kunle', 40, 'AGRIC', '2017-05-02', 'MALE' ], 
        ['Fatima', 45, 'SAP+D', '2017-06-09', 'FEMALE' ], ['ishola', 54, 'CI', '2010-10-13', 'MALE' ],
       ['hibattullah', 24, 'EMINES', '2016-06-21', 'FEMALE' ], ['ghalia', 89, 'ESAFE', '2017-06-01', 'MALE' ],
       ['Sofia', 150, 'GTI', '2012-14-03', 'FEMALE' ], ['akanmu', 78, 'SCI', '2015-04-02', 'FEMALE' ]] 
df2=pd.DataFrame(liist, columns=['NAME','AGE', 'DEPARTMENT', 'ADMISSION DATE', 'GENDER'], dtype=float)

C:\Users\KEHINDE HAFIZ O\anaconda3\ann\lib\site-packages\IPython\core\interactiveshell.py:3444: FutureWarning: Could not cast to float64, falling back to object. This behavior is deprecated. In a future version, when a dtype is passed to 'DataFrame', either all columns will be cast to that dtype, or a TypeError will be raised
  exec(code_obj, self.user_global_ns, self.user_ns)

In [152]:
df2

          NAME    AGE DEPARTMENT ADMISSION DATE  GENDER
0        tunde   23.0        BCH     2020-10-25    MALE
1         kola   44.0        MCB     2021-12-13  FEMALE
2         Bola   12.0        LAW     2019-03-05    MALE
3        kunle   40.0      AGRIC     2017-05-02    MALE
4       Fatima   45.0      SAP+D     2017-06-09  FEMALE
5       ishola   54.0         CI     2010-10-13    MALE
6  hibattullah   24.0     EMINES     2016-06-21  FEMALE
7       ghalia   89.0      ESAFE     2017-06-01    MALE
8        Sofia  150.0        GTI     2012-14-03  FEMALE
9       akanmu   78.0        SCI     2015-04-02  FEMALE

In [153]:
#Convert df admission_date column to datetime

In [154]:
import datetime as dt

In [155]:
df['admission_date']=pd.to_datetime(df['admission_date'])

In [156]:
# to extract the year

In [157]:
df['year'] = df['admission_date'].dt.year

In [158]:
df

      student  Age department cgpa admission_date  gender  year
0       tunde   23        BCH  3.4     2020-10-05    male  2020
1        kola   44        MCB  5.0     2021-12-13  female  2021
2        bola   12        LAW  4.6     2019-03-05    male  2019
3       kunle   40      AGRIC  3.2     2017-05-02    male  2017
4      fatima   45      SAP+D  2.3     2017-06-09  female  2017
5      ishola   54         CI  4.3     2010-10-13    male  2010
6  hibatullah   24     EMINES  4.2     2016-06-21  female  2016
7      ghalia   89      ESAFE  2.8     2017-06-01    male  2017
8       sofia  150        GTI  3.8     2012-10-03  female  2012
9      akanmu   78        SCS  4.3     2015-04-02  female  2015

In [159]:
# to check the month

In [160]:
df['month'] = df['admission_date'].dt.month

In [161]:
df

      student  Age department cgpa admission_date  gender  year  month
0       tunde   23        BCH  3.4     2020-10-05    male  2020     10
1        kola   44        MCB  5.0     2021-12-13  female  2021     12
2        bola   12        LAW  4.6     2019-03-05    male  2019      3
3       kunle   40      AGRIC  3.2     2017-05-02    male  2017      5
4      fatima   45      SAP+D  2.3     2017-06-09  female  2017      6
5      ishola   54         CI  4.3     2010-10-13    male  2010     10
6  hibatullah   24     EMINES  4.2     2016-06-21  female  2016      6
7      ghalia   89      ESAFE  2.8     2017-06-01    male  2017      6
8       sofia  150        GTI  3.8     2012-10-03  female  2012     10
9      akanmu   78        SCS  4.3     2015-04-02  female  2015      4

In [162]:
#to check the year

In [163]:
df['day'] = df['admission_date'].dt.day

In [164]:
df

      student  Age department cgpa admission_date  gender  year  month  day
0       tunde   23        BCH  3.4     2020-10-05    male  2020     10    5
1        kola   44        MCB  5.0     2021-12-13  female  2021     12   13
2        bola   12        LAW  4.6     2019-03-05    male  2019      3    5
3       kunle   40      AGRIC  3.2     2017-05-02    male  2017      5    2
4      fatima   45      SAP+D  2.3     2017-06-09  female  2017      6    9
5      ishola   54         CI  4.3     2010-10-13    male  2010     10   13
6  hibatullah   24     EMINES  4.2     2016-06-21  female  2016      6   21
7      ghalia   89      ESAFE  2.8     2017-06-01    male  2017      6    1
8       sofia  150        GTI  3.8     2012-10-03  female  2012     10    3
9      akanmu   78        SCS  4.3     2015-04-02  female  2015      4    2

In [165]:
#Check for data types of all columns

In [166]:
df.dtypes

student                   object
Age                       object
department                object
cgpa                      object
admission_date    datetime64[ns]
gender                    object
year                       int64
month                      int64
day                        int64
dtype: object

In [167]:
# Check for missing values

In [168]:
df.isnull()

,student,Age,department,cgpa,admission_date,gender,year,month,day
0,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False
5,False,False,False,False,False,False,False,False,False
6,False,False,False,False,False,False,False,False,False
7,False,False,False,False,False,False,False,False,False
8,False,False,False,False,False,False,False,False,False
9,False,False,False,False,False,False,False,False,False

In [169]:
## Check for percentage of  missing values

In [170]:
df.isnull().sum()/10*100

student           0.0
Age               0.0
department        0.0
cgpa              0.0
admission_date    0.0
gender            0.0
year              0.0
month             0.0
day               0.0
dtype: float64

In [171]:
# Check unique values in each of the columns

In [172]:
df['student'].unique()

array(['tunde', 'kola', 'bola', 'kunle', 'fatima', 'ishola', 'hibatullah',
       'ghalia', 'sofia', 'akanmu'], dtype=object)

In [173]:
df['Age'].unique()

array(['23', '44', '12', '40', '45', '54', ' 24', '89', '150', '78'],
      dtype=object)

In [174]:
df['department'].unique()

array(['BCH', 'MCB', 'LAW', 'AGRIC', 'SAP+D', 'CI', 'EMINES', 'ESAFE',
       'GTI', 'SCS'], dtype=object)

In [175]:
df['admission_date'].unique()

array(['2020-10-05T00:00:00.000000000', '2021-12-13T00:00:00.000000000',
       '2019-03-05T00:00:00.000000000', '2017-05-02T00:00:00.000000000',
       '2017-06-09T00:00:00.000000000', '2010-10-13T00:00:00.000000000',
       '2016-06-21T00:00:00.000000000', '2017-06-01T00:00:00.000000000',
       '2012-10-03T00:00:00.000000000', '2015-04-02T00:00:00.000000000'],
      dtype='datetime64[ns]')

In [176]:
df['gender'].unique()

array(['male', 'female'], dtype=object)

In [177]:
#Check number of unique values in each of the columns

In [178]:
df['student'].nunique()

10

In [179]:
df['Age'].nunique()

10

In [180]:
df['department'].nunique()

10

In [181]:
df['admission_date'].nunique()

10

In [182]:
df['gender'].nunique()

2

In [183]:
# Check value counts for each of the columns

In [184]:
 df['student'].value_counts()

tunde         1
kola          1
bola          1
kunle         1
fatima        1
ishola        1
hibatullah    1
ghalia        1
sofia         1
akanmu        1
Name: student, dtype: int64

In [185]:
df['Age'].value_counts()

23     1
44     1
12     1
40     1
45     1
54     1
 24    1
89     1
150    1
78     1
Name: Age, dtype: int64

In [186]:
df['department'].value_counts()

BCH       1
MCB       1
LAW       1
AGRIC     1
SAP+D     1
CI        1
EMINES    1
ESAFE     1
GTI       1
SCS       1
Name: department, dtype: int64

In [187]:
df['admission_date'].value_counts()

2020-10-05    1
2021-12-13    1
2019-03-05    1
2017-05-02    1
2017-06-09    1
2010-10-13    1
2016-06-21    1
2017-06-01    1
2012-10-03    1
2015-04-02    1
Name: admission_date, dtype: int64

In [188]:
df['gender'].value_counts()

male      5
female    5
Name: gender, dtype: int64

In [189]:
# to check the information

In [190]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   student         10 non-null     object
 1   Age             10 non-null     object
 2   department      10 non-null     object
 3   cgpa            10 non-null     object
 4   admission_date  10 non-null     datetime64[ns]
 5   gender          10 non-null     object
 6   year            10 non-null     int64
 7   month           10 non-null     int64
 8   day             10 non-null     int64
dtypes: datetime64[ns](1), int64(3), object(5)
memory usage: 848.0+ bytes

In [191]:
# to check the discription

In [192]:
df.describe().T

       count    mean       std     min      25%     50%     75%     max
year    10.0  2016.4  3.405877  2010.0  2015.25  2017.0  2018.5  2021.0
month   10.0     7.2  3.047768     3.0     5.25     6.0    10.0    12.0
day     10.0     7.4  6.501282     1.0     2.25     5.0    12.0    21.0

In [193]:
# How many rows and columns do you have? show it with df.shape

In [194]:
df.shape

(10, 9)

In [195]:
## Subset the dataframe for male gender

In [207]:
df.query("gender== 'male'")

  student Age department cgpa admission_date gender  year  month  day
0   tunde  23        BCH  3.4     2020-10-05   male  2020     10    5
2    bola  12        LAW  4.6     2019-03-05   male  2019      3    5
3   kunle  40      AGRIC  3.2     2017-05-02   male  2017      5    2
5  ishola  54         CI  4.3     2010-10-13   male  2010     10   13
7  ghalia  89      ESAFE  2.8     2017-06-01   male  2017      6    1

In [208]:
df

      student  Age department cgpa admission_date  gender  year  month  day
0       tunde   23        BCH  3.4     2020-10-05    male  2020     10    5
1        kola   44        MCB  5.0     2021-12-13  female  2021     12   13
2        bola   12        LAW  4.6     2019-03-05    male  2019      3    5
3       kunle   40      AGRIC  3.2     2017-05-02    male  2017      5    2
4      fatima   45      SAP+D  2.3     2017-06-09  female  2017      6    9
5      ishola   54         CI  4.3     2010-10-13    male  2010     10   13
6  hibatullah   24     EMINES  4.2     2016-06-21  female  2016      6   21
7      ghalia   89      ESAFE  2.8     2017-06-01    male  2017      6    1
8       sofia  150        GTI  3.8     2012-10-03  female  2012     10    3
9      akanmu   78        SCS  4.3     2015-04-02  female  2015      4    2

In [209]:
 #Find the mean,max, min, sum CGPA

In [210]:
df['cgpa'].max()

'5.0'

In [211]:
df['cgpa'].min()

'2.3'

In [212]:
df['cgpa'].sum

<bound method NDFrame._add_numeric_operations.<locals>.sum of 0    3.4
1    5.0
2    4.6
3    3.2
4    2.3
5    4.3
6    4.2
7    2.8
8    3.8
9    4.3
Name: cgpa, dtype: object>

In [213]:
df['cgpa'].mean

<bound method NDFrame._add_numeric_operations.<locals>.mean of 0    3.4
1    5.0
2    4.6
3    3.2
4    2.3
5    4.3
6    4.2
7    2.8
8    3.8
9    4.3
Name: cgpa, dtype: object>

In [214]:
#Check your df to be sure that you have all the rows and columns

In [215]:
df.shape

(10, 9)

In [216]:
# write your data frame to a csv file

In [217]:
df.to_csv('project1.csv', index=False)

In [218]:
pd.read_csv('project1.csv')

      student  Age department  cgpa admission_date  gender  year  month  day
0       tunde   23        BCH   3.4     2020-10-05    male  2020     10    5
1        kola   44        MCB   5.0     2021-12-13  female  2021     12   13
2        bola   12        LAW   4.6     2019-03-05    male  2019      3    5
3       kunle   40      AGRIC   3.2     2017-05-02    male  2017      5    2
4      fatima   45      SAP+D   2.3     2017-06-09  female  2017      6    9
5      ishola   54         CI   4.3     2010-10-13    male  2010     10   13
6  hibatullah   24     EMINES   4.2     2016-06-21  female  2016      6   21
7      ghalia   89      ESAFE   2.8     2017-06-01    male  2017      6    1
8       sofia  150        GTI   3.8     2012-10-03  female  2012     10    3
9      akanmu   78        SCS   4.3     2015-04-02  female  2015      4    2